# Домашнее задание 2 

Необходимо реализовать схему, указанную в hw_diagram.pdf

## Описание таблиц 
PeopleStatus - Описание возможных статусов людей, которые есть в университете (Студент, Преподаватель).
Faculties - Описание факультетов, которые есть в университете (KIB, IT, и т.д.).
People - Информация о людях в университете (Имя, почта, ссылка на факультет, ссылка на статус).
Classes - Описание возможных классов в университете (название (Математический анализ) и ссылка на факультет).
Semesters - Справочник семестров факультета(например, Осень2016, '2016-01-01', '2016-12-31').
ClassesSchedule - Расписание классов (ссылки на семестр, преподавателя и курс, день недели, время начала).
StudentsSchedule - Таблица, описывающая, какой студент ходит на какой курс.

In [94]:
# Не забудьте настроить соединение!

## Создание таблиц
Напишет ниже скрипты по созданию таблиц с учетом всех внешних ключей.

In [1]:
%load_ext sql
%sql sqlite:///tst_1.db

'Connected: @tst_1.db'

In [2]:
%%sql 
drop table if exists PeopleStatus ;

CREATE TABLE PeopleStatus 
(
    id integer primary key, 
    status_name varchar(50)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

In [3]:
%%sql 
drop table if exists People;

CREATE TABLE People 
(
    id integer primary key, 
    Name varchar(50),
    Email varchar(100),
    fac_id integer,
    status_id integer,
    foreign key(status_id) references  PeopleStatus(id)
    foreign key(status_id) references   Classes_shedule(teacher_id)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

In [4]:
%%sql 
drop table if exists Faculties;

CREATE TABLE Faculties 
(
    id integer primary key, 
    Faculty_name varchar(50),
    foreign key(id) references  People(fac_id), 
    foreign key(id) references  Classes_shedule(fac_id)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

In [7]:
%%sql 
drop table if exists Classes;

CREATE TABLE Classes 
(
    id integer primary key, 
    description varchar(50),
    fac_id integer,
    foreign key(id) references  Classes_shedule(class_id)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

In [ ]:
%%sql 
drop table if exists Semesters;

CREATE TABLE Semesters 
(
    id integer primary key, 
    shortname varchar(50),
    date_start integer,
    date_end integer,
    foreign key(id) references  Classes_shedule(semester_id)
);

In [8]:
%%sql 
drop table if exists Classes_shedule;

CREATE TABLE Classes_shedule 
(
    id integer primary key, 
    class_id ingeter,
    teacher_id ingeter,
    semester_id ingeter,
    week_day integer,
    time_start varchar(50)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

In [9]:
%%sql
insert into Semesters(id,shortname,date_start,date_end) values(0,);

 * sqlite:///tst_1.db
1 rows affected.

[]

In [ ]:
%%sql
insert into Classes_shedule(id,class_id,teacher_id,semester_id,week_day,time_start) values(0,0,1,3,6,"1 sept");

In [10]:
%%sql
insert into Classes(id,description,fac_id) values(0,"matan",3);
insert into Classes(id,description,fac_id) values(1,"imfotmatika",2);

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
insert Into PeopleStatus(id,status_name) values (1, 'Teacher');
insert Into PeopleStatus(id,status_name) values (2, 'Pupil');

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql
insert Into People(id, Name , Email, fac_id ,status_id) values (0, 'Tom',"12-03a9",3,1);
insert Into People(id, Name , Email, fac_id ,status_id) values (1, 'Andrew',"12sd3a9",3,1);
insert Into People(id, Name , Email, fac_id ,status_id) values (2, 'Mike',"12SDF3a9",2,2);

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
insert Into Faculties(id,faculty_name) values (3, 'IT');
insert Into Faculties(id,faculty_name) values (2, 'KIB');

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite:///tst_1.db
Done.

[]

In [15]:
%%sql
select*
from People p
join PeopleStatus ps
on p.status_id = ps.id
join Faculties f
on f.id = p.fac_id
join Classes s
on s.fac_id = f.id
join Classes_shedule cs
on s.id = cs.class_id

 * sqlite:///tst_1.db
Done.

[(1, 'Andrew', '12sd3a9', 3, 1, 1, 'Teacher', 3, 'IT', 0, 'matan', 3, 0, 0, 1, 3, 6, 1),
 (0, 'Tom', '12-03a9', 3, 1, 1, 'Teacher', 3, 'IT', 0, 'matan', 3, 0, 0, 1, 3, 6, 1)]

## Добавление записей в таблицы
Приведите примеры добавления записей в каждую из таблиц